<!DOCTYPE html>
<html>
<head>
    <link rel="stylesheet" href="css/index.css">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Oswald:wght@200;400&display=swap" rel="stylesheet">
    <title>Portfolio David Cruz</title>
</head>
<header class="navhori">
    <div class="toptext">
        <a href="https://github.com/nikorico12" target="_blank" class="nav-link" id="toptext"> Github</a>
        <a href="index.html" class="nav-link" id="es">Espa&ntilde;ol</a>
        <a href="en/sobremi.html" class="nav-link" id="en">English</a>
    </div>
</header>
<body>
    <nav class="navbar">
        <ul class="navbar-nav" id="nav">
            <li class="nav-item">
                <a href="index.html" class="nav-link">
                    <span class="link-text" id="nombre">David</span>
                </a>
            </li>
            <li class="nav-item">
                <a href="sobremi.html" class="nav-link">
                    <span class="link-text" id="contenido">Sobre mi</span>
                </a>
            </li>
            <li class="nav-item">
                <a href="proyectos.html" class="nav-link">
                    <span class="link-text" id="contenido">Proyectos</span>
                </a>
            </li>
            <li class="nav-item">
                <a href="contacto.html" class="nav-link">
                    <span class="link-text" id="contenido">Contacto</span>
                </a>
            </li>
            <li class="nav-item">
                <a href="index.html" class="nav-link">
                    <span class="link-text" id="nombre">Cruz</span>
                </a>
            </li>
        </ul>
    </nav>
    <main>
		<h1 class="title">Sobre mi</h1>
		<div id="contenido">
		
	<img id="pfp" src="images/yo.png" alt="Un agradable servidor">
	<p>Soy David Cruz, un entusiasta de la informatica y todo de esta. Esto es solo un mostrador de mis proyectos y una presentaci&oacute;n de mi persona. Debajo dejo una lista de conocimientos sobre el campo de la informatica que creo podrian interesar como tambi&eacute;n mi nivel con estos.</p>
	<p style="text-align:justify">&nbsp;</p>
	<h1>Habilidades</h1>
<p style="text-align:center"><strong>Programaci&oacute;n - B&aacute;sico</strong></p>
<ul>
	<li style="text-align: justify;"><strong>Python</strong> - Tengo nivel de programaci&oacute;n basico (Impartido en el instituto), se usar matrices, listas, diccionarios y usar documentos de este.</li>
	<li style="text-align: justify;"><strong>PHP - </strong>He realizado formularios que tratan la informaci&oacute;n transmitida hacia nuestra base de datos y el escape de esta para evitar ataques.</li>
	<li style="text-align: justify;"><strong>Bash Scripting - </strong>Hice una papelera para un ubuntu server, utilizaba diversos comandos, creacion de logs, restauracion de archivos (como la papelera de Windows) y que cada cierto tiempo, esta fuera vaciando los archivos que no habian sido utilizados en los anteriores 2 meses.</li>
</ul>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:center"><strong>Administraci&oacute;n de Sistemas - <em>Intermedio</em></strong></p>

<ul>
	<li style="text-align: justify;"><strong>DHCP</strong> - Creaci&oacute;n de un servidor y aplicaci&oacute;n de diversas configuraciones sobre estos en RedHat, Debian y Windows; y como proteger este servidor, contra de DHCP Spoofing y DHCP Sniffing.</li>
	<li style="text-align: justify;"><strong>DNS</strong> - Creaci&oacute;n de un servidor y configuraci&oacute;n de este en RedHat, Debian y Windows. Y proteccion contra DNS Spoofing.</li>
	<li style="text-align: justify;"><strong>FTP / SFTP</strong> - Creaci&oacute;n de un servidor de ficheros para que se pueda acceder desde una pagina web o para que se pueda usar desde la linea de comandos, configurando permisos y accesibilidad.</li>
	<li style="text-align: justify;"><strong>Servidor Web</strong> - Creacion de servidores web con diferentes configuracion como tambien balanceo de carga. He usado NGINX, Apache2 y IIS.</li>
	<li style="text-align: justify;"><strong>Clusters - </strong>Creaci&oacute;n de un cluster de alta disponiblidad y configurado los nodos de estos.</li>
	<li style="text-align: justify;"><strong>Raids - </strong>Creaci&oacute;n de discos que usaba conjuntamente diversos tipos de Raid ( 0, 1, 5, 10).</li>
	<li style="text-align: justify;"><strong>Virtualizaci&oacute;n -</strong> Virtualizaci&oacute;n local (VirtualBox y VMWare) y un servidor de virtualizaci&oacute;n con 3 maquinas. Y creaci&oacute;n de maquinas virtuales y contenedores en esta.</li>
	<li style="text-align: justify;"><strong>Active Directory - </strong>Simulaci&oacute;n de un Active Directory legal, con creaci&oacute;n massiva de usuarios y configuraci&oacute;n de permisos.</li>
</ul>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:center"><strong>Bases de datos -<em> </em><em>B&aacute;sico</em></strong></p>

<p style="text-align:justify">Tengo conocimientos sobre la estructura de las queries en bases de datos relacionales, especificamente <strong>MySQL</strong> y a como a realizar consultas de diversas opciones de diversas tablas. La creaci&oacute;n de usuarios de estas mismas y manipulaci&oacute;n de datos junto commits y rollbacks</p>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:center"><strong>Administraci&oacute;n de Redes - <em>B&aacute;sico/Intermedio</em></strong></p>

<p style="text-align:justify">Conocimientos sobre las capas OSI y funcionamiento en cada una de ellas, nivel <strong>CCNA</strong>. Configuraci&oacute;n de Routers y Switches, VLANs, Trunking, etc.</p>


		</div>
    </main>
</body>
</html>    